In [30]:
import pandas as pd
import numpy as np
from pandas import Series

## lambda

In [31]:
f = lambda x, y: x + y
f(1,4)

5

In [32]:
def f(x ,y):
    return x + y

In [33]:
f = lambda x: x**2
f(3)

9

In [34]:
f = lambda x: x/2
f(3)

1.5

In [35]:
(lambda x: x + 1)(5)

6

## map

In [36]:
ex = [1,2,3,4,5]
f = lambda x: x**2
list(map(f,ex))

[1, 4, 9, 16, 25]

In [37]:
f = lambda x, y : x + y
list(map(f,ex,ex))

[2, 4, 6, 8, 10]

In [38]:
list(map(lambda x: x+x, ex))

[2, 4, 6, 8, 10]

## map for series

In [39]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [40]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [41]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [42]:
z = {1:'A',2:'B',3:'C'}
s1.map(z).head(5)    # dict type 으로 데이터 교체, 없는 값은 NaN

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [43]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5)    # 같은 위치의 데이터를 s2로 전환

0    10
1    11
2    12
3    13
4    14
dtype: int32

## Example - map for series

In [44]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [45]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [46]:
df["sex_code"] = df.sex.map({"male":0,"female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [47]:
df["height_level"] = df.height.map(lambda x: 'L' if x > 70 else('M' if x > 60 else 'S'))
df.head()

           earn  height     sex   race  ed  age  sex_code height_level
0  79571.299011   73.89    male  white  16   49         0            L
1  96396.988643   66.23  female  white  16   62         1            M
2  48710.666947   63.77  female  white  16   33         1            M
3  80478.096153   63.22  female  other  16   95         1            M
4  82089.345498   63.08  female  white  17   43         1            M

## Replace function

In [48]:
df.sex.replace({"male":0, "female":1}).head()    # dict type 적용

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [49]:
df.sex.replace(["male","female"],[0,1],inplace=True)    # Target list, Conversion list, inplace -> 데이터 변환결과를 적용
df.head(5)

           earn  height  sex   race  ed  age  sex_code height_level
0  79571.299011   73.89    0  white  16   49         0            L
1  96396.988643   66.23    1  white  16   62         1            M
2  48710.666947   63.77    1  white  16   33         1            M
3  80478.096153   63.22    1  other  16   95         1            M
4  82089.345498   63.08    1  white  17   43         1            M

In [50]:
del df["sex_code"]

In [51]:
df

              earn  height  sex   race  ed  age height_level
0     79571.299011   73.89    0  white  16   49            L
1     96396.988643   66.23    1  white  16   62            M
2     48710.666947   63.77    1  white  16   33            M
3     80478.096153   63.22    1  other  16   95            M
4     82089.345498   63.08    1  white  17   43            M
...            ...     ...  ...    ...  ..  ...          ...
1374  30173.380363   71.68    0  white  12   33            L
1375  24853.519514   61.31    1  white  18   86            M
1376  13710.671312   63.64    1  white  12   37            M
1377  95426.014410   71.65    0  white  12   54            L
1378   9575.461857   68.22    0  white  12   31            M

[1379 rows x 7 columns]

## apply for DataFrame

In [52]:
df_info = df[["earn","height","age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [53]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [54]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [55]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [56]:
def f(x):
    return Series([x.min(), x.max()], index = ["min","max"])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

## applymap for DataFrame

In [57]:
f = lambda x: -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [58]:
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64